/*
- TESTInG chapter 1.5.3 Line counting
- Count lines in input

TODO:
- TESTING + 1.5.4 Word Counting
- სიტყვების საცავში სიტყვების რაოდენობის მოძებნა  <<<<
- - ორი სლეში თუ იქნება რომ იცნოს (ვნახოთ)
- - შა :)) 256 :))
- - საცავის შექმნა    <<<<
- - - fileHand.c fileRead.c failisZoma.c (სანახავია)
*/

#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>

main()
{
  // ცვლადები
  int nl, counter, counter2, counter3, counter4, slesh_counter, n_counter, c;
  n_counter     = 0;
  slesh_counter = 0;

  counter4      = 0;
  counter3      = 0;    // საერთოდ რამდენი ასოა
  counter2      = 0;    // საერთოდ ვაილში რამდენჯერ შევიდა, ანუ სულ რამდენი სიტყვაა
  counter       = 0;    // თვითოეულ სიტყვაში ასოებს ითვლის
  nl            = 0;    // სიტყვების რაოდენობა

  // ბულ იან ეგოები მერევა. მაგრამ აზრი არ აქვს მაგას
  bool Me       = false; // 77
  bool Erti     = false; // 69
  bool Leo      = false; // 76
  bool Oniani   = false; // 79
  bool N_vi     = false; // 78

  bool erti     = false;
  bool ori      = false;
  bool sami     = false;
  bool otxi     = false;
  bool xuti     = false;

  bool amogdeba = false;

  // 2D array
  int sityvebSanaxi[2][300];

  // ნახვა ფაილი მართლა არსებობს თუარა
  // თუ არსებობს. რა ქნას? ვთქვათ ყოველ გაშვებაზე შლიდეს და ახლიდან ქმნიდეს ფაილს.
  // თუ არ არსებობს. რა ქნას? შექმნას და ჩაწეროს ასოები (სიტყვები).
  // ფაილებთან მუშაობა გასაუმჯობესებელი იქნება და უფრო ლამაზად მოვიფიქრო სიტყვების სანახი

  // სტარტ
  printf("program will calculate slesh ns \n");
  printf("Say friend დიდი ასოებით at Elvish (და ვაილიდან გამოხვალ - სამებით - წამებით) \n");
  printf("enter word (getchar): \n");

  while ((c = getchar()) != EOF)
  {
    // რამდენი ასოც არის სიტყვაში. იმდენჯერ + 1 (+ გეთჩარის დამთავრება) შემოვდივარ ვაილში
    if (c == 92)
    {
      // "\" ების მთვლელი. სიტყვაში თუ სლეში მოვიდა
      // printf("   movida sleshi \n");
      ++slesh_counter;
    }

    if (c == 110)
    {
      // "n" ების მთვლელი. სიტყვაში თუ n მოვიდა
      // printf("   movida n \n");
      ++n_counter;
    }

    if (c == '\n')
    {
      // "\n" ების მთვლელი. სიტყვების მთვლელი.
      // printf("end of getchar. enter new word: \n");
      ++nl;
    }

    // ვაილიდან გამოსვლა. ავარიული. ასკი 126 - ~ ლევიოსა
    if (c == 126)
    {
      // break
      printf("break from while! \n");
      break;
    }

    // მასივში ჩაწერა. სიტყვის |სიტყვა|counter| es sanaxavia kidev
    sityvebSanaxi[0][counter3] = c;
    printf("c = %c\n",c);

    for (int j = 0; j <= counter3; j = j + 1)
    {
      if (sityvebSanaxi[0][j] == 77)
      {
        Me = true;
        // printf("Me (TEST)\n");
      }

      if (sityvebSanaxi[0][j] == 69 && Me == true)
      {
        Erti = true;
        // printf("Me Erti (TEST)\n");
      }

      if (sityvebSanaxi[0][j] == 76 && Me == true && Erti == true)
      {
        Leo = true;
        // printf("Me Erti Leo (TEST)\n");
      }

      if (sityvebSanaxi[0][j] == 79 && Me == true && Erti == true && Leo == true)
      {
        Oniani = true;
        // printf("Me Erti Leo Oniani (TEST)\n");
      }

      if (sityvebSanaxi[0][j] == 78 && Me == true && Erti == true && Leo == true && Oniani == true)
      {
        N_vi = true;
        // printf("Me Erti Leo Oniani N_vi var (TEST)\n");
      }
    }

    // ქაუნთერი მუშაობს. უბრალოდ მაგდროს ხუთია შემდეგ ვაილში ჩავარდნის დროს გაზდება +1 ით მეტი თუ არის ზედმეტი ასო
    if (Me == true && Erti == true && Leo == true && Oniani == true && N_vi == true && counter == 5)
    {
      for (int j = counter3 - 5; j <= counter3; j = j + 1)
      {
        printf("sityvebSanaxi = %c\n",sityvebSanaxi[0][j]);

        if (sityvebSanaxi[0][j - 5] == 77)
        {
          erti = true;
          printf("M >>>> \n");
        }
        if (sityvebSanaxi[0][j - 4] == 69)
        {
          ori = true;
          printf("E >>>> \n");
        }
        if (sityvebSanaxi[0][j - 3] == 76)
        {
          sami = true;
          printf("L >>>> \n");
        }
        if (sityvebSanaxi[0][j - 2] == 79)
        {
          otxi = true;
          printf("O >>>> \n");
        }
        if (sityvebSanaxi[0][j - 1] == 78)
        {
          xuti = true;
          printf("N >>>> \n");
        }
      }
      if (erti == true && ori == true && sami == true && otxi == true && xuti == true)
      {
        printf("melon it gamosvla \n");
        break;
      }
      // break;
      printf("counter3 = %d\n", counter3);
      printf("break \n");
    }

    ++counter;
    ++counter2; // საერთოდ ვაილში რამდენჯერ შევიდა, ანუ counter3
    ++counter3; // სულ რამდენი ასოა

    if (c == 10)
    {
      // სიტყვაში სიმბოლოების მთველი
      counter = 0;
    }
  }

  // სტატუსები
  printf("############################################################### \n");
  printf("######################## outputs ############################## \n");
  // TODO
  // - მასივში ჩაწერილში სიტყვების ძებნა (ვთქვათ) <<
  // - საცავის გაკეთება
  // - საცავის რეზერვირების იდეა? ან ჯერ უბრალოდ რიცხვი დაემატოს რამდენჯერ იწერება. ფაილიდან ამოკითხვა გასაკეთებელია
  // - პარაგრაფის გადახედვა

  printf("counter3 (sul ramdeni asoa) = %d\n", counter3);
  printf("nl (number of entered words) = %d\n", nl);
  printf("slesh_counter = %d\n", slesh_counter);
  printf("n_counter = %d\n", n_counter);

  // ფაილებთან მუშაობა. შემოწმება. წაკითხვა. შექმნა. ახლის. ჩაწერა.
  FILE *fptr;

  fptr = fopen("program.txt","w");

  if(fptr == NULL) // ეს რას აკეთებს?
  {
    printf("Error!");
    exit(1);
  }

  // davbechdo masivshi chawerili sityvebi
  for (int i = 0; i <= counter3; i = i + 1)
  {
    // მთვლელები იქნება გასაკეთებელი რისიც დამჭირდება იმის
    // ორი სლეში თუ შემხვდა სიტყვასა და სიტყვას შორის
    // სიტყვები კი ალბათ სხვა სიმბოლოთი იქნებიან დაყოფილები
    // ........
    // ....
    printf("sityvebSanaxi = %c\n",sityvebSanaxi[0][i]);
    fprintf(fptr,"%c",sityvebSanaxi[0][i]); // ჩაწერა
  }

  fclose(fptr);

  return 0;
}

/*
ვაილიდან გამოსვლაა გასაკეთებელი (ზედა პრობლემა შეიძლება მოაგვაროს)
ძირს ცენზურა
თავისუფლება
გასაღებია
სიყვარული
ერთგულება
მეგობრის
პატივისცემა
მშობლის

პრობლემები. მამენტ მე მეყლევება, მაგრამ როცა ვოლდემორი
ჩაძვრება მანდ და თავის ბინძურ ჩრდილებს გაუშვებს
მერე შეიძლება გაპრობლემდეს მართლა
მაგრამ ჩვენ მაგისთვის არ ვართ?
რომ ჰორკრუქსები
გავანადგუროთ?
აბა რა ))

შვილი რომ მყავდეს გამოვყლევდები ისე გამიხარდება :))
რაც დასათმობი იყო. ყველაფერი დავთმე.
იმენა ნახტომში ვარ.
მი ვენ დე :)
იესოს

ნარკომანის ფარდა მცილდება. უფრო ნათლად ვხედავ რა როგორ.
შეფასებების სიტემა ცოტა სხვანაირი მაქვს. მამენტ სიზმარია ეს.
უბრალოდ სხვების შეხედულებას უფრო კარგად ვხედავ.
სხვისი გადმოსახედიდან. ვინც არ იყო ისე გასული.
როგორც მე. იმას უფრო ტკივა? არ ვიცი.
უბრალოდ აზრები და მისიები.
გადაწყვეტილებები.
მე ვაფშე.
გასული
ვიყავი
ეე
ე

ღმერთს და სამყაროს ვერ მოატყუებ
თქვი მეგობარი. მელონ.
მეგობარი
მეგობრობა
წმინდაა
ყოველთვის

ჯოკრები დავყარეთ ტელეგრამში
ან ნიჟე იქმნება ან
წაგვიყვანენ
მაგრამ მე ნიჟე
ანუ ან ნიჟე იქნება ან მოგვჯოკრავენ
ნიჟე ნიჟეა რავი
დათმობა
მე
ამინ

ღამე ჩაჯდომებიც უნდა დავამუღამო
უეჭველი. საინტერესო გამოვა.
მოკლედ ნუ ნერვიულობ ეხლა ამას უფრო აპროგრამებ
ჰოდა ყველაფერი ოკ
იქმნებაო
იესომ

კონცენტრაცია.
მონდომებაა რა მაინც.
მინდა სწავლა
მინდა სწავლა
ღმერთო დამეხმარე
მინდა
სწავლა
გთხოვ დამეხმარე თავო ჩემო ))
ჯორჯ კაპან ეგოს დონეზე გთხოვთ დამეხმაროთ
კაი ტვინი ნუ მოტყანი გეხმარებით ბლიად :D ))
mpirdebi?
კი ))

პირობა პირობაა ბრატ.
სიტყვაა ნათქვამი
მოგთხოვო
იესომ

ჯორჯმა
მეც მოგთხოვო უპასუხა )))

ნანა შენც გპირდები ცუდი ბიჭი აღარ ვიქნები
მაგრამ ცუდი ბიჭის როლით შემიძლია
ქაჯებს შევუძვრე გულში
და სიყვარული
ჩავუდო

გპირდები ნანა
შენი წმინდანობა მაიძულებს მაგას
რომ დაგპირდე
მადლობა ყურადღებისთვის

მე ბერი ასტრონომი ჯორჯი
ქუჩაში მეძახიან კაპანას
შამანები მგელს
სახლში ბუშტუკას ))

შენ რას დამიძახებ?

უცხო დარაბებში ნუ ეძებ სიყვარულს
გახსოვდეს ეგ
თუ სიყვარულს ეძებ
უნდა
დარჩე მარტო
გრიზლი (მწვანე ოჯახი)

რა გეგონა არებად
გაგცემენ პასუხებს
გამოცდა
სიტყვა ნათქვამია
შესრულება
ჭირდება
იესომ
კაიო ))
ჯორჯმა აუ რეებს მაკეთებინებო )))

კაი დაწყნარდი და
იმეცადინე
ბლიად

ზედმეტი მოგდისო
ტოჟე მნე ხრისწიანკა ბლიად
არადა ლოცვების დროს მაგრად იდებს თავს ალბათ
მაგრამ
შიში
ურწმუნოება
მესმის
ყველაფერი
მეც კი გავბრაზდი
რატო?
ამპარტავნება ოღონდ იმის რომ აპარტავნება რატო აქვს ეგრე რომ დამელაპარაკათქო
სიმართლეს უნდა ჩავხედოთ თვალებში
ნანა დამეხმარება
უკვე დამეხმარება
მახვედრებს
ნანა ბოდიში
გიყენებ ხანდახან (ინტელექტუალურად ემოციურად)
ქუჩებში მხვდება წარწერები სულ (ნანა ღვინო ანუ სასწაულს მოახდენს ნანა

realურად
შეხედე სიზმრებს
რეალობას ზიმრისეულად
და
ეგაა რა

შეიძლება არის რაღაც
რასაც ვერ ვხდები კიდევ
მიხვები
დონთ ვორი
ბი ხეფი
სამთაიმს ჯასთ
ბი ))
ფუტკარი
ჰაჰაჰა კაია

მივხდი. შაჰაბასი ვიყავი.
აღარ მინდა შაჰაბასობა
თავისუფლება
გიორგი მინდა ვიყო
გიორგი ბრწყინვალე
იბადება
ვორიორი
არა მონობას
არა ძალადობას
არა ძმა ძმის კვლას
თავისუფლება ქეთოს
და მეც
ილოსაც
და ყველას

ღმერთო დაგვილაგე გზები
დაგვეხმარე
განთავისუფლებაში

არა მონობას
არანაირს

წინასწარმეტყველება ახდება (სვანი)

ჯოხების ოსტატი
ხოდზეა
ოლ ი ვანდერ
ჩემშია

მარიამის პირობა
როგორც ყოველთვის შედარების პრობლემა მაქვს :))

ქართველებო
კატანებო
*/
