/*
- TESTInG chapter 1.5.3 Line counting
- Count lines in input
*/

#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>


main()
{
  // ცვლადები
  int nl, c, counter, counter2;
  counter2 = 0; // საერთოდ ვაილში რამდენჯერ შევიდა, ანუ სულ რამდენი სიტყვაა
  counter  = 0; // თვითოეულ სიტყვაში ასოებს ითვლის
  nl       = 0; // სიტყვების რაოდენობა

  // 2D array
  int sityvebSanaxi[2][300];


  // სტარტ
  printf("program will calculate slesh ns \n");
  printf("enter word (getchar): \n");

  while ((c = getchar()) != EOF)
  {
    // რამდენი ასოც არის სიტყვაში. იმდენჯერ + 1 (+ გეთჩარის დამთავრება) შემოვდივარ ვაილში

    if (c == 92)
    {
      // "\" ების მთვლელი. სიტყვაში თუ სლეში მოვიდა
      printf("   movida sleshi \n");
    }

    if (c == 110)
    {
      // "n" ების მთვლელი. სიტყვაში თუ n მოვიდა
      printf("   movida n \n");
    }

    if (c == '\n')
    {
      // "\n" ების მთვლელი. სიტყვების მთვლელი.
      // printf("end of getchar. enter new word: \n");
      ++nl;
    }

    if (c == 10)
    {
      // სიტყვაში სიმბოლოების მთველი
      counter = 0;
    } else {
      // წერა. სიტყვების ასკი კოდების
      // printf("counter = %d\n", counter);
      printf("ascii of c words = %d\n",c);
    }

    // მასივში ჩაწერა. სიტყვის |სიტყვა|counter|
    sityvebSanaxi[0][counter2] = c;

    ++counter;
    ++counter2;
  }
  // სტატუსები
  printf("counter2 = %d\n",counter2);
  printf("nl (number of entered words) = %d\n", nl);

  // რა დედის ტყვნა უნდა ამას ეხლა?
  for (int i = 0; i <= 7; i = i + 1)
  {
    //printf("asoebi - %d\n",sityvebSanaxi[0][i]);
    printf("shemovedi aq\n");
  }
}

/*
პრობლემები. მამენტ მე მეყლევება, მაგრამ როცა ვოლდემორი
ჩაძვრება მანდ და თავის ბინძურ ჩრდილებს გაუშვებს
მერე შეიძლება გაპრობლემდეს მართლა
მაგრამ ჩვენ მაგისთვის არ ვართ?
რომ ჰორკრუქსები
გავანადგუროთ?
აბა რა ))

შვილი რომ მყავდეს გამოვყლევდები ისე გამიხარდება :))
რაც დასათმობი იყო. ყველაფერი დავთმე.
იმენა ნახტომში ვარ.
მი ვენ დე :)
იესოს

ნარკომანის ფარდა მცილდება. უფრო ნათლად ვხედავ რა როგორ.
შეფასებების სიტემა ცოტა სხვანაირი მაქვს. მამენტ სიზმარია ეს.
უბრალოდ სხვების შეხედულებას უფრო კარგად ვხედავ.
სხვისი გადმოსახედიდან. ვინც არ იყო ისე გასული.
როგორც მე. იმას უფრო ტკივა? არ ვიცი.
უბრალოდ აზრები და მისიები.
გადაწყვეტილებები.
მე ვაფშე.
გასული
ვიყავი
ეე
ე
*/
