// gagrdzeleba 3 - struct - ebidan - video განვაგრძო - Struct_totirial შია struct ების მაგალითები
// Buildgin a Guessing Game (loop ებით) ვნახოთ რას აკეთებს და მეთვითნ გავაკეთო

#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <time.h>
#include <math.h>
#include <conio.h>
#include <stdbool.h>
#include <string.h>
#include <errno.h>

int parametrebi_Brzanebis(char* brzaneba)
{
  /* ფუნქციის აღწერა:
  აბრუნებს ლოგიკურ ერთიანს თუ ჩარების მასივი შედგება მხოლოდ ციფრებისგან
  თუ არა აბრუნებს ლოგიკურ ნულიანს. ამოწმებს 2.3 ში წერტილ სიმბოლოს.
  არ დაუშვებს ორ წერტილს. წერტილით დაწყებას.
  */

  bool cifria = false; // თუ მასივში ციფრები წერია გათრუვდება
  int len, counter_par = 0, counter_mdzime = 0;

  len = strlen(brzaneba);
  // printf("len = %d \n",len);

  for (int i = 0; i <= len; i++)
  {
    // printf("brzaneba(d)[%d] %d %c \n",i,brzaneba[i],brzaneba[i]);
    // printf("i = %d \n", i);
    if (brzaneba[0] >= 48 && brzaneba[0] <= 57)
    {
      if ((brzaneba[i] >= 48 && brzaneba[i] <= 57 || brzaneba[i] == 46) || brzaneba[i] == 0)
      {
        cifria = true;
      } else
      {
        cifria = false;
        break;
      }
      if (brzaneba[i] == 46)
      {
        // ითვლის წერტილების რაოდენობას 3.3 ერთი წერტილია, 3.3.3 - ორი წერტილია. დაბლ რიცხვების შეყვანისთვის
        counter_mdzime++;
      }

      if (counter_mdzime > 1)
      {
        // printf("counter_mdzime %d \n", counter_mdzime);
        cifria = false;
      }
    }
    counter_par++;
  }
  // printf("counter_par = %d \n",counter_par);
  // printf("cifria = %d \n", cifria);
  return cifria;
}


int main()
{

  return 0;
}

/*
ლუკამ დამირეკა და შეიძლება ხვალ აბასთუმანში წავიდე
დღეს დამესიზმრა რომ ვიყავი აბასთუმანში. ყველა იყო იკა ანი ბავშვები
თორნე ვერა ბავშვები
თიკუკა ნიკუშა მაშო ელენე
ყველას ვეხუტებოდი.
მერე დამესიზმრა ქეთი. მართვის მოწმობას იღებდა. დამესიზმრა რომ ჩუმად შევხდით
ჩვენს ქუჩაზე. სადღაც სხვანაირი საბურთალო იყო და სხვანაირი პეკინი და სადღაც მანდ.
ხილბოსტნის კაცი იყო და ყიდიდა რაღაცეებს. ქეთი ხატავდა და ისეთი რაღაც უნდა დაეხატა
რაც მე გამახარებდა. მე კიდევ უნდა მემუშავა რომ ქეთის ხატვის ძალა ქონოდა.
არადა ვიცი რომ ხატვა მაგრად ჭირდება. ნუ რათქმაუნდა ვერ მოვითმინე და ყურში ჩავჩურჩულე
ქეთ მართლა აღარ გიყვარვარ? და სანამ რამეს მეტყოდა პასუხის შემეშინდა და გადავაკეთე კითხვა
და არაა არაა მეგობრულ სიყვარულზე გეუბნებოდი :))) ჰოდა შემომხედა და მითხრა დებილი ხარო
მოკლედ ქეთის დაურეკეს მერე იასნია და წასასვლელი იყო. წავიდა. ჰოდა მეც წავედი.
მერე მე კომპიუტერთან ვიჯექი და თითქოს გვერძე მეჯდა მაგრამ ანუ არ იყო გვერძე მაგასთან სხვა სიტოაციები
იჩითებოდა ჩემთან სხვა. ორივე ვჩალიჩობდით რაღაცას კომპიუტერით და ალბათ ვწერდით და მაგიტომ ჩანდა ისე
თითქოს გვერდიგვერდ ვიჯექით.
სამუშაო დღის ბოლოს დამირეკა fula - მ. (დღეს ვფიქრობდი რომ თუ ისევ ნახულობ დემონურ სიზმრებს
შავ გეტოსთან ახლოს თეთრმა ანგელოზებმა მითხრეს და მივხდი რომ მართლა ეგრე მოხდა და ანუ ნუ კი პიზდეცია
მაგრამ fula სთან სზიმრებში რომ კონტაქტი მაქვს ძაან ასწორებს - ფრაქტალური ქრისტე). მოკლედ დღესაც ვნახე რა
სფიქსიც ვნახე. და მერე დიდი კამანდა. და წავედით ერთად ვინტის (მეტამფეტამინი) საჩალიჩოდ. და ვეუბნებოდი ყველაზე
მაგარი გოგო მყავსთქო. ნუ თან მანდ მახსოვდა რომ ჩემი გოგო არ იყავი მაგრამ მაგ სიზმრაში... მოკლედ ნუ რა აზრი აქვს
შენზე ვუყვებოდი ყველაზე მაგარი გოგოათქო. 
*/
