// Building a better calculator and other staff

#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <time.h>
#include <math.h>
#include <conio.h>

int main()
{
  // ჩემით უნდა გავაკეთო ეს კალკულატორი. შვადარო ვიდეოს კალკულატორს. ვნახოთ შეიძლება საღამოს ჩავუჯდე.
  // ფუნქციები ხომ არ გამოვიყენო? დავწერო მიმატება გამოკლება გაყოფა გამრავლება ფესვი კვადრატი კუბი ფუნქციებად (ორი რიცხვისთვის)
  // ორი რიცხვის მიღება კლავიატურიდან. ბაგებზე უნდა შევამოწმო. მერე გკითხავს რა გინდა უქნა ამათ. მიუმატო თუ გამოაკლო და
  // რომელსაც აირჩევ იმ ფუნქციას გამოიყენებ. პრინციპში ყველაფერი არის რაც ვიდეოში გავიარე. გეგმა.
   

  return 0;
}
