/*
Building a better calculator and other staff

ჩემით უნდა გავაკეთო ეს კალკულატორი. შვადარო ვიდეოს კალკულატორს. ვნახოთ შეიძლება საღამოს ჩავუჯდე.
ფუნქციები ხომ არ გამოვიყენო? დავწერო მიმატება გამოკლება გაყოფა გამრავლება ფესვი კვადრატი კუბი ფუნქციებად (ორი რიცხვისთვის)
ორი რიცხვის მიღება კლავიატურიდან. ბაგებზე უნდა შევამოწმო. მერე გკითხავს რა გინდა უქნა ამათ. მიუმატო თუ გამოაკლო და
რომელსაც აირჩევ იმ ფუნქციას გამოიყენებ. პრინციპში ყველაფერი არის რაც ვიდეოში გავიარე. გეგმა.
ჯერ მარტივი ვარიანტი გავაკეთოთ6
მერე იყოს ვარიანტი როცა პასუხი გაქვს უკვე და ახალ ოპერაციას უკეთებ და კლავიატურიდან შეგყავს კიდევ რაღაცეები.
ჯერ ორი რიცხვის შეყვანა შეიძლებოდეს და მერე რამდენიც გინდა იმდენის?
1+1+1+1+1+1 = 6 + 1 + 1 + 1 = 9 ს. ესეთი რაღაც რომ დაიწეროს რა :))
ამოცანა ესეც :)
რეილიბით გუის გაკეთება გარშემო. კარგი ამოცანა იქნება
*/

#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <time.h>
#include <math.h>
#include <conio.h>

double sameba(double ricxvi)
{
  // შემოწმების ფუნქცია კიდევ საჭირო იქნება გადაყვანის ფუნქცია ასკიდან გადაიყვანოს რიცხვებში
  double pasuxi = ricxvi * ricxvi * ricxvi;
  return pasuxi;
}


int main()
{
  // ცვლადები
  char brzaneba[51];          // სტრინგებისთვის ან ასკით უნდა გადავამოწმო მერე. მოდი ვცადოთ. და ფორით გადარბენა?
  char test_tuaris_ricxvi[51];  // ვნახოთ რა გამოვა
  int ricxvi1,ricxvi2,pasuxi;

  // იო ს ფორმის განსაზღვრა და ვარიანტები
  gets(brzaneba);
  printf("brzaneba %s \n",brzaneba);

  for (int i = 0; i <= sizeof(brzaneba); i++)
  {
    printf(" %d\n", i);
    printf("brzaneba(d)[0] %d \n",brzaneba[i]);

    if (brzaneba[i] >= 48)
    {
      //
    }
  }

  // შემოწმების ალგორითმი რიცხვია თუ არა რომ შეამოწმოს და გითხრას პასუხი



  return 0;
}


if (brzaneba[i] != 0 && amomgdebaPirveliNulis == false)
{
  counterPassword ++;
  // printf("პაროლის სიგრზე (counterPassword) is %d\n",counterPassword);
  if (counterPassword >= 6)
  {
    pirobasigrze = true;
  }

} else if (brzaneba[i] == 0 && amomgdebaPirveliNulis == false) {
  // როცა მასივში იპოვა ნული
  amomgdebaPirveliNulis = true;
}


// გასარჩევია 0 რომ იპოვა და დათვალა რამხელა იყო შეყვანილი მასივის სიგრძე. რაც დაკავებულია ანუ.



/*
ბალროგთან ბრძოლა გრძელდება თურმე...
შეეცდება ისეთი რაღაცეები გაკაკეთებინოს რომ ახლობლებთან კონფლიქტი მოგივიდეს
და შენი თავი შენვე დაგამარცხებინოს. ამიტომ ძაან ნაგლი დემონია.
ფრთხილად უნდა იყო და რვეულში ჩაწერილ ალგორითმს მიყვე. და სინდისს.
და ვალი გაქვს კიდევ და უნდა დააბრუნო შრომით. სხვა გზა არ გაქვს. ვაჰ...
და ტირლლის უფლებაც არ გაქვს ეხლა. პირიქით ყველაფერი რაც ბალროგმა გაგაკეთებინა
გამოიყენე გაკვეთილად და მის წინააღმდეგ მიმართე.
მისივე ხრიკები მის წინააღმდეგ.
ანუ შენ უნდა იქცეოდე
სინდისიერად.
გაიღიმე.
ეგრეაო ;)
იესომ..
და ბუდამ...

ისეთი სევდა და შიში მეწვია ძალა წამართვა თითქოს სულ და ხსნას ველი
პატრონუსი უნდა გავუშვა სამივე ჯოხიდან
პატრონუს

არ მიყვარს ესე რომ ვამბოხოლმე მაგრამ შაბათია
და დიდად კი არ მინდა მაგრამ ვასო პაპას
რჩევას ვენდობი და მისტერ რობოტს ვრთავ
ჰეი მისტერ რობორტ :)
ჰაკერობაზე რადგან არის მეშინაია ყურება
ანუ პროგრამირების მეცადინეობის ისე მეშინაია
სერიალის ყურებაზეც უარს ვამბობდი ვაჰ
მშიშარა კაპანა. არადა პროსტა ტვინს სხვა ჰებითები გაქვს
და უნდა შეცვალო რა. უცებ წესიერი კაცი რომ გახდეს ეგრევე ნარკომანი. ეგრე არ იქნება ნელ ნელა მოხდება.
ასევე ნარკომანიც ეგრევე ვერ გახდება წესიერი კაცი. და დრო ჭირდება ნელა ნელა ტუკუ ტუკუს ტყუილად არ
ვიძახი. მოკლედ
კაპანას. წარსულიდან მომავალში ვუგზავნი ამ ნაწერს 
*/
