// gagrdzeLeba - სინდისის აღდგენა (სინდისით იარე - ეგ გიშველის - და ნუ - გეშინია)

#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <time.h>
#include <math.h>

int main() // main და main(void) ს შორის რა განსხვავებაა უნდა გავიგო მერე (ალბათ ამ კურსში იქნება)
{
  // variables
  char brzaneba[100];
  char name[33];
  const int NUMB = 5;


  int numb = 41;
  printf("ნამბერ %d ყლეები \n", numb);
  numb = 5;
  printf("ნამბერ %d ესენიც ყლეები, ზატო რუსებისკენ არ არიან \n", numb);
  printf("გაიმარჯვებენ %d \n", NUMB);
  printf("გაიმარჯვებენ %d \n", NUMB);

  printf("So\'S - ღმერთის დახმარებაა საჭირო და ჩვენი ხელის განძრევა \n");

  printf("%f \n", pow(2, 3));   // pow()  - ხარისხში აყვანა
  printf("%f \n", ceil(45.6));  // ceil() - დამრგალება ზემოთ
  printf("%f \n", floor(45.6)); // - ქვემოთ დამრგვალება


  // Getting users input
  gets(brzaneba);
  printf("gets(brzaneba) კლავიატურიდან შეყვანილი ბრძანება (სტრინგად) %s \n",brzaneba);

  // scanf() - რატომღაც არ მომწონდა. სლეშებს ვერ ამუღამებს "გიორგი კაპანაძე" და აღიქვავს მარტო "გიორგი" -ს )) სირობა მოკლედ
  printf("scanf() ბრძანებით შეყვანა ტექსტის \n");
  scanf("%s",&brzaneba); // ამპერსანტი უნდა თუარა ხზ. უნდა ალბათ
  printf("brzaneba = %s \n",brzaneba);

  return 0;
}








































// (- ორი მთავარი ლოცვა -)
// ნუგეშის მცემელის ლოცვა
// მამაო ჩვენო
// ბევრი იკითხეთო. ცოდნა. შრომა.
// უმანკოს შეცდენა ადვილია და ღმერთი წყალობს :))) უმანკოს
// სინდისი გააღვიძე.
// სხვას ისეთი რამე არ გაუკეთო, რაც შენ რომ გაგიკეთონ გეწყინება.
// სამი გამოცდა. უფალი ჩავიდა ჯოჯოხეთში და სულები ამოიყვანა. ამუ ქვა მერე გადახტომა.ჯოჯოხეთში ჩავარდნა.
// და იქ ეშმკას არ უნდა ეთაყვანო
// სიკვდილი ანუ. 930 წლის ადამი ამოიყვანა. ევაც ტიროდა. ევას სიცოცხლე ქვია სხვანაირად.
// აmპარტავნება. სიზმარმაცე. გარყვნილება.
// მიშას სიტყვები: არ უნდა მისცე ხელმწიფება ოლიგარქებს. :))))
//
// შრომა შრომა და შრომა. ბებო მიყვება თინას ამბავს.
// მარტო როცა დაგტოვებენ, რწმენა მაშინ უნდა შეინარჩუნო. :))
// ყოველწუთას გამოცდაა გვაქვს. უნდა ჩავაბაროთ ყოველ წუთს. არასდროს არ მორჩება ეს. ვაჰ.
// აინშტაინმა თქვა ისეთი სიტყვები აქვს იესოს მაგის გარდა ვერავინ იტყოდაო. ღმერთი არის სიყვარული. :))
//
// ღმერთი როცა გსჯის მისი ძუძუები გლოცავენ. :)))
// არ უნდა გეშინოდესო. მამა გაბრიელმა. ესეა საჭიროო. :)
// ნოეს სამი შვილი. სემი იაფეტი და ქამი
// თურქებზე ვლაპარაკობთ.
// იაფეტელები ვართ ქრისტიანები. იზრაელი იბერიელი ერთი და იგივეაო :)
// მომიტევე ვითარცა მე მივუტევებ სხვებს. გთხოვ. :( სული მტკივა - მეშინია) - სინანულით ვიწმინდებით. და შრომით.
// სინანულით და შრომით. სხვისთვის როცა შრომობ მოგეტევება.
// ისევ სინდისთან მივედით. :)
