/*
Building a better calculator and other staff

ჩემით უნდა გავაკეთო ეს კალკულატორი. შვადარო ვიდეოს კალკულატორს. ვნახოთ შეიძლება საღამოს ჩავუჯდე.
ფუნქციები ხომ არ გამოვიყენო? დავწერო მიმატება გამოკლება გაყოფა გამრავლება ფესვი კვადრატი კუბი ფუნქციებად (ორი რიცხვისთვის)
ორი რიცხვის მიღება კლავიატურიდან. ბაგებზე უნდა შევამოწმო. მერე გკითხავს რა გინდა უქნა ამათ. მიუმატო თუ გამოაკლო და
რომელსაც აირჩევ იმ ფუნქციას გამოიყენებ. პრინციპში ყველაფერი არის რაც ვიდეოში გავიარე. გეგმა.
ჯერ მარტივი ვარიანტი გავაკეთოთ6
მერე იყოს ვარიანტი როცა პასუხი გაქვს უკვე და ახალ ოპერაციას უკეთებ და კლავიატურიდან შეგყავს კიდევ რაღაცეები.
ჯერ ორი რიცხვის შეყვანა შეიძლებოდეს და მერე რამდენიც გინდა იმდენის?
1+1+1+1+1+1 = 6 + 1 + 1 + 1 = 9 ს. ესეთი რაღაც რომ დაიწეროს რა :))
ამოცანა ესეც :)
რეილიბით გუის გაკეთება გარშემო. კარგი ამოცანა იქნება
*/

#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <time.h>
#include <math.h>
#include <conio.h>
#include <stdbool.h>
#include <string.h>

// fuqnciebi
int sigrdzeBrzanebis(char* brzaneba)
{
  /* კლავიატურიდან შეყვანილ ბრძანებას (char ების მასივს) გადათვლის და დააბრუნებს რიცხვს. სიგრძეს.
  ფუნქცია რომელიც პირველ ნულს შეამოწმებს */

  bool amomgdebaPirveliNulis = false;
  int counterSigrdze = 0;
  int len = strlen(brzaneba);

  for (int i = 0; i <= len; i++)
  {
    // printf(" %d\n", i);
    printf("brzaneba(d)[0] %d \n",brzaneba[i]);
    // printf("strlen(brzaneba) = %d\n",strlen(brzaneba));

    if (brzaneba[i] != 0 && amomgdebaPirveliNulis == false)
    {
      counterSigrdze ++;
    } else if (brzaneba[i] == 0 && amomgdebaPirveliNulis == false) {
      // როცა მასივში იპოვა ნული
      amomgdebaPirveliNulis = true;
    }
  }
  printf("counterSigrdze = %d\n", counterSigrdze);
  return counterSigrdze;
}

double sameba(double ricxvi) // არ ვიყენებ
{
  // შემოწმების ფუნქცია კიდევ საჭირო იქნება გადაყვანის ფუნქცია ასკიდან გადაიყვანოს რიცხვებში
  double pasuxi = ricxvi * ricxvi * ricxvi;
  return pasuxi;
}


int main()
{
  // ცვლადები
  // ჩარები
  char brzaneba[51];  // სტრინგებისთვის ან ასკით უნდა გადავამოწმო მერე. მოდი ვცადოთ. და ფორით გადარბენა?
  // ინტები
  int ricxvi1;
  int ricxvi2;
  int pasuxi;

  gets(brzaneba);
  printf("brzaneba %s \n",brzaneba);
  sigrdzeBrzanebis(brzaneba);

  // მჭირდება ფუნქცია რომელიც აიღებს სიგრძეს.
  // და მეტყვის ციფრებისგან შედგება თუ არა. მოცემული შეყვანილი ბრძანება.

  return 0;
}



// გასარჩევია 0 რომ იპოვა და დათვალა რამხელა იყო შეყვანილი მასივის სიგრძე. რაც დაკავებულია ანუ.

/*
ბალროგთან ბრძოლა გრძელდება თურმე...
შეეცდება ისეთი რაღაცეები გაკაკეთებინოს რომ ახლობლებთან კონფლიქტი მოგივიდეს
და შენი თავი შენვე დაგამარცხებინოს. ამიტომ ძაან ნაგლი დემონია.
ფრთხილად უნდა იყო და რვეულში ჩაწერილ ალგორითმს მიყვე. და სინდისს.
და ვალი გაქვს კიდევ და უნდა დააბრუნო შრომით. სხვა გზა არ გაქვს. ვაჰ...
და ტირლლის უფლებაც არ გაქვს ეხლა. პირიქით ყველაფერი რაც ბალროგმა გაგაკეთებინა
გამოიყენე გაკვეთილად და მის წინააღმდეგ მიმართე.
მისივე ხრიკები მის წინააღმდეგ.
ანუ შენ უნდა იქცეოდე
სინდისიერად.
გაიღიმე.
ეგრეაო ;)
იესომ..
და ბუდამ...

ისეთი სევდა და შიში მეწვია ძალა წამართვა თითქოს სულ და ხსნას ველი
პატრონუსი უნდა გავუშვა სამივე ჯოხიდან
პატრონუს

არ მიყვარს ესე რომ ვამბოხოლმე მაგრამ შაბათია
და დიდად კი არ მინდა მაგრამ ვასო პაპას
რჩევას ვენდობი და მისტერ რობოტს ვრთავ
ჰეი მისტერ რობორტ :)
ჰაკერობაზე რადგან არის მეშინაია ყურება
ანუ პროგრამირების მეცადინეობის ისე მეშინაია
სერიალის ყურებაზეც უარს ვამბობდი ვაჰ
მშიშარა კაპანა. არადა პროსტა ტვინს სხვა ჰებითები გაქვს
და უნდა შეცვალო რა. უცებ წესიერი კაცი რომ გახდეს ეგრევე ნარკომანი. ეგრე არ იქნება ნელ ნელა მოხდება.
ასევე ნარკომანიც ეგრევე ვერ გახდება წესიერი კაცი. და დრო ჭირდება ნელა ნელა ტუკუ ტუკუს ტყუილად არ
ვიძახი. მოკლედ
კაპანას. წარსულიდან მომავალში ვუგზავნი ამ ნაწერს.

kapan-ჩართე სვანი კაცი-მოხუცი სანტოსი.
არაფერზე არ ვნერვიულობ. ემოციებს ვაკონტროლებ. შიშები ფეხებს ვერ მჭამს სვანი ვარ.
სანტოსობა ასწორებს. :) საქციელებიც ეგეთი უნდა მქონდეს. როცა სვანი ვარ.
*/
