// Struct in C - ყალიბები c ენაში

#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <time.h>
#include <math.h>
#include <conio.h>
#include <stdbool.h>
#include <string.h>
#include <errno.h>

int main()
{
  //

  return 0;
}

/*
struct ების რატომღაც მეშინოდა
გადავწყვიტე რომ შიში დავამარცხო
ყველაფერი თუ სასაცილოა რამის შიშიც სასაცილოა )))
ჰოდა რავი ვიყოთ ნაგლი უშიშრები და თავით გავლეწოთ ყველა დაბრკოლება
ხომ იცი რომ რა დაბრკოლებაც არ უნდა იყოს ყველაფერს გალეწავ თუ მოინდომებ
რა გვიშლიდა მონდომებაში ხელს? შიში? ჰო რაღაც სირობების თან
არადა რას ვკარგავთ ისედაც ვზივართ არაფერს ვაკეთებთ....
არც ფული გვაქვს არაფერი...
როგორც ბებო იტყოდა კაი ცხენით ადვილია მისვლა ფინიშამდეო და
აბა ჯაგლაგით თუ მიხვალო
და ეტყობა რთული მისია ავიღე და ვთქვი ყველაფერი სასაცილოათქო და ჯაგლაგსაც მივაყვანინებ თავსთქო ჰაჰაჰა
ღადაობაა ვირით კი დავდივარ ამდენიხანია ისე ლეპტოპიც გავირებული მყავს აგერ წინა ფეხები ავუწიე და დადის ))))
მაინც მივალ მივხოხდები როგორც სიზმარში ვნახე
არ დავნებდები რაც არ უნდა მატკინონ წამართვან ლეპტოპი გამიფუჭონ რამეს მოვახერხებ
არ დავნებდები არააა
)))) ჯორჯ კაპანას ძე ჯეზუსი
ჰო და შევეცი ყველას ვინც გადამაჯერებს ამას იმიტომ რომ ყველა შეეცდება
შემდეგი გამოცდა ეგ გექნება ყველა შეეცდება დაგაჯეროს რომ ეგრე არ არის
და უნდა გალეწო ყველა ბარიერი
იმიტომ რომ სხვა გზა არ გვაქვს
იმიტომ რომ შეგვიძლია
რატომ არის თამაში ჯადოსნური?
იმიტომ რომ ნამდვილია
ხოდა ეგრე 
*/
